{
  "users": [
    {
      "userName": "Santhosh",
      "userEmail": "mangeogod0987@gmail.com",
      "userPassword": "Password@123",
      "isAdmin": true,
      "id": 1
    },
    {
      "userName": "Dhanush",
      "userEmail": "dhanush@gmail.com",
      "userPassword": "Password@123",
      "isAdmin": true,
      "id": 2
    },
    {
      "userName": "TKR",
      "userEmail": "tkr@gmail.com",
      "userPassword": "Password@123",
      "isAdmin": false,
      "id": 3
    },
    {
      "userName": "Prashanth",
      "userEmail": "prashanth@gmail.com",
      "userPassword": "Password@97",
      "isAdmin": false,
      "id": 4
    },
    {
      "userName": "Arthi",
      "userEmail": "arthi2000@gmail.com",
      "userPassword": "Arthi2000@Lms",
      "isAdmin": false,
      "id": 5
    },
    {
      "userName": "merlins",
      "userEmail": "merlins@gmail.com",
      "userPassword": "Merlins2001@Lms",
      "isAdmin": false,
      "id": 6
    },
    {
      "userName": "Dhanush2",
      "userEmail": "dhanush2@gmail.com",
      "userPassword": "Dhanush2002@Lms",
      "isAdmin": false,
      "id": 7
    },
    {
      "userName": "ArthiMeganathan",
      "userEmail": "arthi@gmail.com",
      "userPassword": "Arthi2001@Lms",
      "isAdmin": false,
      "id": 8
    },
    {
      "userName": "Hamza",
      "userEmail": "hamza2000@gmail.com",
      "userPassword": "Hamza2000@Lms",
      "isAdmin": false,
      "id": 9
    },
    {
      "userName": "test user",
      "userEmail": "testuser@gmail.com",
      "userPassword": "Test2022@Lms",
      "isAdmin": false,
      "id": 10
    },
    {
      "userName": "DhanushBaskaran",
      "userEmail": "dhanushbaskaran2001@gmail.com",
      "userPassword": "Dhanush2000@Lms",
      "isAdmin": false,
      "id": 11
    },
    {
      "userName": "SriniVasan",
      "userEmail": "srini2001@gmail.com",
      "userPassword": "Srini2001@Lms",
      "isAdmin": false,
      "id": 12
    },
    {
      "userName": "Mukesh",
      "userEmail": "mukesh2001@gmail.com",
      "userPassword": "Mukesh2001@Lms",
      "isAdmin": false,
      "id": 13
    },
    {
      "userName": "Amarnath",
      "userEmail": "amar2001@gmail.com",
      "userPassword": "Amar2001@Lms",
      "isAdmin": false,
      "id": 14
    },
    {
      "userName": "Vijay",
      "userEmail": "vijay2001@gmail.com",
      "userPassword": "Vijay2001@",
      "isAdmin": false,
      "id": 15
    },
    {
      "userName": "Kural",
      "userEmail": "kural2001@gmail.com",
      "userPassword": "kural2001@lms",
      "isAdmin": false,
      "id": 16
    }
  ],
  "books": [
    {
      "title": "PHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax: A practical guide to combining the power, performance, scalability, ... time, and high performance of PHP",
      "author": "Yuli Vasiliev",
      "categories": "technologies",
      "year": "2007",
      "edition": "1st Ed.",
      "language": "english",
      "pages": "375",
      "description": "Based on the title, the book has so many things to discuss but it actually has less than 400 pages that even include the glossary of terms. The reader might have a second thought about the book since it might not promise to discuss the things written in the chapter.\r\rBut if you go through the chapters, you will be surprised how each topic could be discussed thoroughly in this book. Using the traditional structures in most web and application development books, it slowly introduces each concept before they are brought together in the final chapters. \r\rPHP and Oracle are discussed separately at first with sample codes and situations to ensure that the reader understands each concept. It then goes to discuss who they could be efficiently integrated. The final chapter which is about Ajax is very impressive as it gives the developers a chance to develop an Ajax based application using popular practices in web development. The robustness of Oracle and efficiency of PHP is actually shown in an Ajax based application.\r\rPHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax is a good starting book for any web development professionals and enthusiasts. It covers the basics of web development using PHP and database management of Oracle including an installation guide for Oracle and PHP. If you are looking for a book to start with PHP and Oracle, this book offers a good start. \r\rFor developers who are experienced in this discipline, the book could be a good reference point for developing an application. The sample codes that helps the reader understands the underlying concept of the application with actual scenarios, this PHP and Oracle book is almost too good to pass on.",
      "available": true,
      "image": "https://m.media-amazon.com/images/I/51XLVIAvV5L._SX404_BO1,204,203,200_.jpg",
      "quantity": 3,
      "id": 6
    },
    {
      "title": "MODx Web Development",
      "author": "Antano Solar John, Antano Solar John",
      "categories": "technologies",
      "year": "2009",
      "edition": "",
      "language": "en",
      "pages": "276",
      "description": "Like someone else said, you can learn MODx by finding resources on the internet. I started reading this book to get introduced to the system, and it was OK for that, but I found I didn't really use it or need it when I actually started making my MODx site. It's a good overview/introduction that may help you understand what MODx is and how it functions, but not totally needed if you just want to jump right in and make a site with MODx. Also, since the release of MODx 1.0/1.0.1, the terminology used in this book is no longer correct, so it may actually confuse you (Resources are now Elements, Documents are now Resources, etc.) And I found some of the writing to be awkward.",
      "available": true,
      "image": "https://static.packt-cdn.com/products/9781847194909/cover/smaller",
      "quantity": 3,
      "id": 8
    },
    {
      "id": 10,
      "title": "Professional JavaScript for Web Developers",
      "author": "Nicholas C. Zakas",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "2",
      "language": "en",
      "pages": "841",
      "url": "http://bookzz.org/dl/682507/a9cd0c",
      "description": "Probably the most complete and updated book that you may find about Javascript.The author made a great job writting about some of the most important topics on javascript development and highlighting the difference among browsers.Most of the topics are already covered in other javascript books I have read before, but not in the way Nicholas does, he usually goes deeper on every topic.If you have some knowledge on javascript and want to reach another level, this is the book for you. If you consider yourself a guru, you may enjoy it as well, but definitely, not for newbies.",
      "cover": "http://libgen.org/covers/254000/b07adfcaf9641b17fe76115bf174f44c-d.jpg",
      "quantity": 6,
      "available": true,
      "image": "https://m.media-amazon.com/images/I/71AEYAnrQML.jpg"
    },
    {
      "id": 11,
      "title": "Art of Java Web Development: Struts, Tapestry, Commons, Velocity, JUnit, Axis, Cocoon, InternetBeans, WebWork",
      "author": "Neal Ford",
      "categories": "technologies",
      "volume": "",
      "year": "2003",
      "edition": "",
      "language": "en",
      "pages": "624",
      "url": "http://bookzz.org/dl/740977/339164",
      "description": "A guide to the topics required for state of the art Web development, this book covers wide-ranging topics, including a variety of web development frameworks and best practices. Beginning with coverage of the history of the architecture of Web applications, highlighting the uses of the standard web API to create applications with increasingly sophisticated architectures, developers are led through a discussion on the development of industry accepted best practices for architecture. Described is the history and evolution towards this architecture and the reasons that it is superior to previous efforts. Also provided is an overview of the most popular Web application frameworks, covering their architecture and use. Numerous frameworks exist, but trying to evaluate them is difficult because their documentation stresses their advantages but hides their deficiencies. Here, the same application is built in six different frameworks, providing a way to perform an informed comparison. Also provided is an evaluation of the pros and cons of each framework to assist in making a decision or evaluating a framework on your own. Finally, best practices are covered, including sophisticated user interface techniques, intelligent caching and resource management, performance tuning, debugging, testing, and Web services.",
      "cover": "http://libgen.org/covers/314000/2d822f49188d9edaa78f2085f8e2737f-d.jpg",
      "quantity": 7,
      "available": true,
      "image": "https://www.finlandiakirja.fi/media/catalog/product/cache/d736c1dee3794630c3835723ca38a3d2/7/z/7zz2vs_1052390_0.jpg"
    },
    {
      "title": "Beginning CSS Web Development: From Novice to Professional",
      "author": "Simon Collison",
      "categories": "technologies",
      "year": "2006",
      "edition": "paperback",
      "language": "english",
      "pages": "448",
      "description": "Beginning CSS Web Development: From Novice to Professional, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use 'ActiveRecord' to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the 'Action Pack' framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's 'DRY Principle' by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well.",
      "available": true,
      "quantity": 4,
      "image": "https://m.media-amazon.com/images/I/71j6aLBlXbL.jpg",
      "id": 13
    },
    {
      "title": "Flask Web Development: Developing Web Applications with Python",
      "author": "Miguel Grinberg",
      "categories": "Computer",
      "year": "2014",
      "edition": "1",
      "language": "en",
      "pages": "258",
      "description": "Flask Web Development: Developing Web Applications with Python, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use 'ActiveRecord' to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the 'Action Pack' framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's 'DRY Principle' by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.",
      "available": true,
      "image": "https://learning.oreilly.com/library/cover/9781491991725/250w/",
      "quantity": 8,
      "id": 31
    },
    {
      "id": 33,
      "title": "Developing Web Apps with Haskell and Yesod: Safety-Driven Web Development",
      "author": "Michael Snoyman",
      "categories": "technologies",
      "volume": "",
      "year": "2015",
      "edition": "2",
      "language": "en",
      "pages": "396",
      "url": "http://bookzz.org/dl/2492858/ec8ee3",
      "description": "Developing Web Apps with Haskell and Yesod: Safety-Driven Web Development, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use 'ActiveRecord' to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the 'Action Pack' framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's 'DRY Principle' by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.",
      "cover": "http://libgen.org/covers/1319000/216cf240cc02944b2f77ba17b6a44d49-d.jpg",
      "quantity": 8,
      "available": true,
      "image":"https://learning.oreilly.com/library/cover/9781491915585/250w/"
    },

    {
      "id": 35,
      "title": "Web Design for Developers: A Programmer's Guide to Design Tools and Techniques (The Pragmatic Programmers)",
      "author": "Brian P. Hogan",
      "categories": "Computer Science/Web/Web Design",
      "volume": "technologies",
      "year": "2009",
      "edition": "1",
      "language": "en",
      "pages": "327",
      "url": "http://bookzz.org/dl/643560/c97777",
      "description": "I've been a programmer / developer all my working life and I've never really understood all that web design stuff. At last I've found a book that explains it in a clear way you can understand without being treated like a rocket scientist or the village idiot. I definately recommend this. It does what it says in the title.",
      "cover": "http://libgen.org/covers/215000/0644b25822aff6b1def036019c467f52-d.jpg",
      "quantity": 8,
      "available": true,
      "image": "https://m.media-amazon.com/images/I/41p96KMPOuL._SX338_BO1,204,203,200_.jpg"
    },
    {
      "id": 36,
      "title": "PHPEclipse: A User Guide: Take advantage of the leading open source integrated development environment to develop, organize, and debug your PHP web development projects.",
      "author": "Shu-Wai Chow",
      "categories": "technologies",
      "volume": "",
      "year": "2006",
      "edition": "",
      "language": "en",
      "pages": "228",
      "url": "http://bookzz.org/dl/2284255/db588a",
      "description": "PHPEclipse: A User Guide: Take advantage of the leading open source integrated development environment to develop, organize, and debug your PHP web development projects., open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use 'ActiveRecord' to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the 'Action Pack' framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's 'DRY Principle' by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.",
      "cover": "http://libgen.org/covers/1115000/47dcc653aa3f73886699e93be3415d20-d.jpg",
      "quantity": 8,
      "available": true,
      "image":"https://m.media-amazon.com/images/I/41fe6dzDYiL._SX198_BO1,204,203,200_QL40_FMwebp_.jpg"
    },
    {
      "id": 37,
      "title": "GIS for Web Developers: Adding Where to Your Web Applications (2007)(en)(254s)",
      "author": "Scott Davis",
      "categories": "technologies",
      "volume": "",
      "year": "2007",
      "edition": "1",
      "language": "en",
      "pages": "262",
      "url": "http://bookzz.org/dl/501342/294ba1",
      "description": "With this book readers can become real geographic programmers using the Java programming language. They will find working code examples in Java using some of the many GIS-oriented applications and APIs, and be able to display GIS data on the Web, manipulate GIS data, and programmatically store and retrieve it in geographically enabled databases.",
      "cover": "http://libgen.org/covers/69000/97d33d4600942592a9593dbda717f582-d.jpg",
      "quantity": 8,
      "available": true,
      "image":"https://m.media-amazon.com/images/I/51pU1LR7zrL._SX415_BO1,204,203,200_.jpg"
    },
    {
      "id": 39,
      "title": "Spring Web Flow 2 Web Development",
      "author": "Sven Lüppken, Markus Stäuble",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "",
      "language": "en",
      "pages": "272",
      "url": "http://bookzz.org/dl/608485/939377",
      "description": "Spring Web Flow 2 Web Development, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use 'ActiveRecord' to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the 'Action Pack' framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's 'DRY Principle' by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.",
      "cover": "http://libgen.org/covers/180000/afbf1346c4b006c9397e140431e6d7f6-d.jpg",
      "quantity": 8,
      "available": true,
      "image":"https://static.packt-cdn.com/products/9781847195425/cover/smaller"
    },
    {
      "id": 40,
      "title": "Catalyst - Accelerating Perl Web Application Development",
      "author": "Jonathan Rockway",
      "categories": "technologies",
      "volume": "",
      "year": "2007",
      "edition": "",
      "language": "en",
      "pages": "198",
      "url": "http://bookzz.org/dl/614573/d480fd",
      "description": "Книга Catalyst - Accelerating Perl Web Application Development Catalyst - Accelerating Perl Web Application Development Книги WEB дизайн/разработка Автор: Jonathan Rockway Год издания: 2007 Формат: pdf Издат.:Packt Publishing Страниц: 200 Размер: 3 ISBN: 1847190952 Язык: Русский0 (голосов: 0) Оценка:Книгао хорошем веб-фреймворке написанном на Perl.",
      "cover": "http://libgen.org/covers/186000/38156a4cfb71d8a3eb551b8b0716da4e-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 41,
      "title": "Spring Web Flow 2 Web Development",
      "author": "Sven Lüppken, Markus Stäuble",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "",
      "language": "en",
      "pages": "272",
      "url": "http://bookzz.org/dl/633089/862dd2",
      "description": "<P>Master Spring's well-designed web frameworks to develop powerful web applications  <ul><li>Design, develop, and test your web applications using the Spring Web Flow 2 framework</li>  <li>Enhance your web applications with progressive AJAX, Spring security integration, and Spring Faces</li>  <li>Stay up-to-date with the latest version of Spring Web Flow</li>  <li>Walk through the creation of a bug tracker web application with clear explanations</li></ul></p>      <P><b>In Detail </p>  <P>Many web applications need to take the user through a defined series of steps such as e-commerce checkouts or user registrations. Spring Web Flow works well for rich and flexible user interaction, additionally it helps you to describe the flow of websites in complex processes. Spring Web Flow 2 provides the perfect way to build these kinds of features, keeping them secure, reliable, and easy to maintain.</p>  <P>This book provides a platform on which you can build your own applications and services. It gives detailed information on Spring basics and covers core topics involving testing, security, and so on. We develop a complete, robust web application using the latest version of Spring, where page navigation is done on-the-fly.</p>  <P>This book teaches you how to work with Spring Web Flow. It covers both basic and advanced aspects and provides a detailed reference of the features Spring Web Flow. The book helps readers to extend the framework.</p>  <P>The integration of Spring and Java Server Pages is clearly explained in the book. The book also explains the essential modules of the complete Spring framework stack and teaches how to manage the control flow of a Spring web application.</p>  <P>The Spring Faces module will provide integration between Spring Web Flow and Java Server Faces (JSF). Testing, an important aspect of the software development process is covered towards the end; the question of how to test a Spring Web Flow application is answered.</p>        <P><b>What you will learn from this book? </p>  <ul><li>Explore the features of Spring Web Flow 2 to develop powerful applications</li><li>Extend the framework to take it beyond its out-of-the-box feature set</li><li>Get started with Spring Faces, Spring JavaScript, and Spring Binding and improve the handling of the web flow</li><li>Test your Spring application and rest assured of its quality before going live</li><li>Secure your web applications using Spring Security and Spring Web Flow</li><li>Integrate JavaServer Faces (JSF) with Spring Web Flow to organize and manage the storage of data inside your web application</li></ul>     <P><b>Approach </p>    <P>This book is a tutorial, with plenty of step-by-step instructions beginning with \"getting started\" material, followed by advanced coverage of this technology. The book has a practical approach towards the Spring MVC framework and is packed with practical examples and code. </p>       <P><b>Who this book is written for? </p>  <P>This book is targeted at Java web application developers who want to work on Spring Web Flow. This book is a must-read for those who desire to bridge the gap between the popular web framework and the popular application framework. It requires prior knowledge of the Spring framework, but no prior knowledge of Spring Web Flow. </p>",
      "cover": "http://libgen.org/covers/205000/864e925f1ae5e758ad9a1dc6ff7d9a1a-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 42,
      "title": "GIS for Web Developers: Adding 'Where' to Your Web Applications",
      "author": "Scott Davis",
      "categories": "technologies",
      "volume": "",
      "year": "2007",
      "edition": "1",
      "language": "en",
      "pages": "258",
      "url": "http://bookzz.org/dl/656152/65ace4",
      "description": "Easy to read.  Comprehensive.  Easily one of the best IT books that I own.  I am in Australia, but the US emphasis did not detract from my learning experience.",
      "cover": "http://libgen.org/covers/228000/25843874a016719643cf94d47a2e6ba9-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 43,
      "title": "Even Faster Web Sites: Performance Best Practices for Web Developers",
      "author": "Steve Souders",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "1",
      "language": "en",
      "pages": "256",
      "url": "http://bookzz.org/dl/682357/ca2b32",
      "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
      "cover": "http://libgen.org/covers/254000/2209885316f24f95f082dc38fe7f8154-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 44,
      "title": "Spring Web Flow 2 Web Development",
      "author": "Sven Lüppken, Markus Stäuble",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "",
      "language": "en",
      "pages": "272",
      "url": "http://bookzz.org/dl/682381/0f8f9d",
      "description": "This book was largely a rehash of Spring Web Flow XSD's and Configuration files. The author started by introducing a fairly simple login application with a basic Web Flow. The author skimmed over explaining this basic application. I fully expected the author to continue to build on this example and further explain how to setup and configure a flow and use the power of Spring WebFlow to build a modern JSF based web application. Instead I was presented with page after page of XSD samples and configuration file snippets. The author did a very poor job explaining Web Flow concepts and how all this works together. I will have trouble even using this book as an adequate reference book to augment the online Spring documentation. I definitely would not recommend this book.",
      "cover": "http://libgen.org/covers/254000/c4e2e386c7ccb3decc1fe645f01af770-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 45,
      "title": "Developing Large Web Applications: Producing Code That Can Grow and Thrive",
      "author": "Kyle Loudon",
      "categories": "technologies",
      "volume": "",
      "year": "2010",
      "edition": "1",
      "language": "en",
      "pages": "302",
      "url": "http://bookzz.org/dl/682503/6824d8",
      "description": "The book essentially covers how to code up a large application without a framework. In reality if you are working with a large application (or not) you should use an existing framework to manage PHP, HTML templates, and JavaScript. For example CodeIgniter, (I haven't found a PHP HTML templating system I like yet), and Dojo. \r\rtl;dr - has some stuff you should know, but better to let a framework(s) do it for you.",
      "cover": "http://libgen.org/covers/254000/95819b5f3eb0e4bfeecd369e7400a9b2-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 46,
      "title": "Even Faster Web Sites: Performance Best Practices for Web Developers",
      "author": "Steve Souders",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "1",
      "language": "en",
      "pages": "256",
      "url": "http://bookzz.org/dl/739050/d5623a",
      "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
      "cover": "http://libgen.org/covers/312000/b649272bed7a50044e66dd0ec236156e-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 47,
      "title": "Even Faster Web Sites: Performance Best Practices for Web Developers",
      "author": "Steve Souders",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "1",
      "language": "en",
      "pages": "256",
      "url": "http://bookzz.org/dl/739106/226385",
      "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
      "cover": "http://libgen.org/covers/313000/e917ededf6c573dd6b4fd11b17834657-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 48,
      "title": "Spring Web Flow 2 Web Development",
      "author": "Sven Luppken, Markus Stauble",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "",
      "language": "en",
      "pages": "272",
      "url": "http://bookzz.org/dl/843714/941e48",
      "description": "This book is a tutorial, with plenty of step-by-step instructions beginning with \"getting started\" material, followed by advanced coverage of this technology. The book has a practical approach towards the Spring MVC framework and is packed with practical examples and code. This book is targeted at Java web application developers who want to work on Spring Web Flow. This book is a must-read for those who desire to bridge the gap between the popular web framework and the popular application framework. It requires prior knowledge of the Spring framework, but no prior knowledge of Spring Web Flow.",
      "cover": "http://libgen.org/covers/418000/70deaa673153eb8a2235614725cd8546-d.jpg",
      "quantity": 8,
      "available": true
    },
    {
      "id": 49,
      "title": "Communicating Design: Developing Web Site Documentation for Design and Planning (2nd Edition) (Voices That Matter)",
      "author": "Dan M. Brown",
      "categories": "technologies",
      "volume": "",
      "year": "2009",
      "edition": "2",
      "language": "en",
      "pages": "312",
      "url": "http://bookzz.org/dl/853858/fc50d6",
      "description": "Successful web design teams depend on clear communication between developers and their clients—and among members of the development team. Wireframes, site maps, flow charts, and other design diagrams establish a common language so designers and project teams can capture ideas, track progress, and keep their stakeholders informed.    In this all new edition of Communicating Design, author and information architect Dan Brown defines and describes each deliverable, then offers practical advice for creating the documents and using them in the context of teamwork and presentations, independent of methodology. Whatever processes, tools, or approaches you use, this book will help you improve the creation and presentation of your wireframes, site maps, flow charts, and other deliverables.   The book now features:  An improved structure comprising two main sections: Design Diagrams and Design Deliverables. The first focuses on the nuts and bolts of design documentation and the second explains how to pull it all together.  New deliverable: design briefs, as well as updated advice on wireframes, flow charts, and concept models.  More illustrations, to help designers understand the subtle variations and approaches to creating design diagrams. Reader exercises, for those lonely nights when all you really want to do is practice creating wireframes, or for use in workshops and classes. Contributions from industry leaders: Tamara Adlin, Stephen Anderson, Dana Chisnell, Nathan Curtis, Chris Fahey, James Melzer, Steve Mulder, Donna Spencer, and Russ Unger.     “As an educator, I have looked to Communicating Design both as a formal textbook and an informal guide for its design systems that ultimately make our ideas possible and the complex clear.”  —Liz Danzico, from the Foreword  ",
      "cover": "http://libgen.org/covers/428000/6488ceaac907b23528d5a39f98372648-d.jpg",
      "quantity": 7,
      "available": true
    },
    {
      "title": "Something I Never Told You",
      "author": "Shravya Bhinder",
      "categories": "Romance",
      "volume": "2",
      "year": "2019",
      "edition": "paperback",
      "language": "English",
      "pages": "259",
      "description": "When in love, you tend to take each other for granted, and sometimes, that can cost you a lifetime of togetherness . . .Ronnie knew that his first crush was way out of his league, and yet he pursued and wooed Adira. Shyly and from a distance in the beginning, and more persuasively later. He couldn't believe it when the beautiful Adira actually began to reciprocate, falling in love with him for his simplicity and honesty. Slowly, as they get close and comfortable with each other, life takes on another hue. From truly magical it becomes routine. There are fights and then making-up sessions-a clash of egos and doubts.Things begin to change for the worst.It is too late.Ronnie and Adira will probably never find their forever after . . ",
      "quantity": 12,
      "isAvailable": true,
      "image": "https://m.media-amazon.com/images/I/91PQFpYWLwL.jpg",
      "id": 51
    },
    {
      "title": "Secret",
      "author": "Rhonda Byrne",
      "categories": "self-help",
      "volume": "1",
      "year": "2006",
      "edition": "HardCover",
      "language": "English",
      "pages": "446",
      "description": "Rhonda Byrne is the creator behind The Secret, a documentary film that swept the world in 2006, changing millions of lives and igniting a global movement. Later that same year, Rhonda's book of The Secret was released. It has been translated into more than fifty languages.",
      "quantity": "10",
      "isAvailable": true,
      "image": "https://m.media-amazon.com/images/I/61mEFHtyGVL._SX394_BO1,204,203,200_.jpg",
      "id": 53
    },
    {
      "title": "Treasure Island",
      "author": " Robert Louis Stevenson,",
      "categories": "adventure",
      "volume": "1",
      "year": "1959",
      "edition": "HardCover",
      "language": "french",
      "pages": "400",
      "description": "Treasure Island (originally titled The Sea Cook: A Story for Boys[1]) is an adventure novel by Scottish author Robert Louis Stevenson, telling a story of \"buccaneers and buried gold\". It is considered a coming-of-age story and is noted for its atmosphere, characters, and action.\n\nThe novel was originally serialised from 1881 to 1882 in the children's magazine Young Folks, under the title Treasure Island or the Mutiny of the Hispaniola, credited to the pseudonym \"Captain George North\". It was first published as a book on 14 November 1883 by Cassell & Co. It has since become one of the most often dramatized and adapted of all novels, in numerous media.",
      "quantity": "5",
      "isAvailable": true,
      "image": "https://m.media-amazon.com/images/I/51W7H0q4HPL._SX328_BO1,204,203,200_.jpg",
      "id": 55
    },
    {
      "title": "Things We Never Got Over",
      "author": "Lucy Score",
      "categories": "Romance",
      "volume": "1",
      "year": "2022",
      "edition": "PaperBack",
      "language": "French",
      "pages": "572",
      "description": "Bearded, bad-boy barber Knox prefers to live his life the way he takes his coffee: Alone. Unless you count his basset hound, Waylon.\nKnox doesn’t tolerate drama, even when it comes in the form of a stranded runaway bride.\n\nNaomi wasn’t just running away from her wedding. She was riding to the rescue of her estranged twin to Knockemout, Virginia, a rough-around-the-edges town where disputes are settled the old-fashioned way…with fists and beer. Usually in that order.\n\nToo bad for Naomi her evil twin hasn’t changed at all. After helping herself to Naomi’s car and cash, Tina leaves her with something unexpected. The niece Naomi didn’t know she had. Now she’s stuck in town with no car, no job, no plan, and no home with an 11-year-old going on thirty to take care of.\n\nThere’s a reason Knox doesn’t do complications or high-maintenance women, especially not the romantic ones. But since Naomi’s life imploded right in front of him, the least he can do is help her out of her jam. And just as soon as she stops getting into new trouble he can leave her alone and get back to his peaceful, solitary life.\n\nAt least, that’s the plan until the trouble turns to real danger.\n",
      "quantity": "9",
      "isAvailable": true,
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1641629293i/60060431.jpg",
      "id": 56
    },
    {
      "title": "King Solomon's Mine",
      "author": "H. Rider Haggard",
      "categories": "adventure",
      "volume": "1",
      "year": "1937",
      "edition": "HardCover",
      "language": "English",
      "pages": "561",
      "description": "In 1882, Irish dream chaser Patrick \"Patsy\" O'Brien and his daughter Kathy have failed to strike it rich in the diamond mines of Kimberley, South Africa (then the Cape Colony). They persuade a reluctant Allan Quartermain to drive them to the coast in his wagon.\n\nAlong the way, they encounter another wagon carrying two men in bad shape. Umbopa recovers, but Silvestra Getto dies after boasting to Quartermain that he has found the way to the fabled mines of Solomon. Patsy finds the dead man's map and sneaks off during the night, unwilling to risk his daughter's life. Kathy is unable to persuade Quartermain to follow him; instead, they rendezvous with Quartermain's new clients, Sir Henry Curtis and retired naval commander John Good, who are hunting for big game.",
      "quantity": "6",
      "isAvailable": true,
      "image": "https://upload.wikimedia.org/wikipedia/en/e/ea/King-Solomon%27s-Mines_1937.jpg",
      "id": 57
    },
    {
      "title": "The Mysterious Island",
      "author": "Jules Verne",
      "categories": "adventure",
      "volume": "2",
      "year": "1875",
      "edition": "PaperBack",
      "language": "English",
      "pages": "233",
      "description": "The Mysterious Island follows the adventures of a group of castaways who use their survivalist savvy to build a functional community on an uncharted island. A hot-air balloon carrying five passengers and a dog escapes from Richmond, Va., during the American Civil War.\n",
      "quantity": "1",
      "isAvailable": true,
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Ile_Mysterieuse_02.jpg/440px-Ile_Mysterieuse_02.jpg",
      "id": 58
    }
  ],
  "rented-books": [
    {
      "bookTitle": "MODx Web Development",
      "bookId": 8,
      "rentDays": "1",
      "rentDate": "2023-01-12T18:40:05.643Z",
      "returnDate": "2023-01-13T18:40:05.643Z",
      "userId": "3",
      "rentExpired": false,
      "userName": "TKR",
      "id": 8
    },
    {
      "bookTitle": "Professional JavaScript for Web Developers",
      "bookId": 10,
      "rentDays": "4",
      "rentDate": "2023-01-13T06:57:49.451Z",
      "returnDate": "2023-01-17T06:57:49.451Z",
      "userId": "6",
      "rentExpired": false,
      "userName": "merlins",
      "id": 11
    },
    {
      "bookTitle": "Communicating Design: Developing Web Site Documentation for Design and Planning (2nd Edition) (Voices That Matter)",
      "bookId": 49,
      "rentDays": "6",
      "rentDate": "2023-01-13T07:00:22.756Z",
      "returnDate": "2023-01-19T07:00:22.756Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 12
    },
    {
      "bookTitle": "Beginning CSS Web Development: From Novice to Professional",
      "bookId": 13,
      "rentDays": "4",
      "rentDate": "2023-01-16T04:06:21.143Z",
      "returnDate": "2023-01-20T04:06:21.143Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 15
    },
    {
      "bookTitle": "Professional JavaScript for Web Developers",
      "bookId": 10,
      "rentDays": "1",
      "rentDate": "2023-01-16T04:55:09.917Z",
      "returnDate": "2023-01-17T04:55:09.917Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 17
    },
    {
      "bookTitle": "Professional JavaScript for Web Developers",
      "bookId": 10,
      "rentDays": "2",
      "rentDate": "2023-01-16T04:58:21.632Z",
      "returnDate": "2023-01-18T04:58:21.632Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 18
    },
    {
      "bookTitle": "Art of Java Web Development: Struts, Tapestry, Commons, Velocity, JUnit, Axis, Cocoon, InternetBeans, WebWork",
      "bookId": 11,
      "rentDays": "1",
      "rentDate": "2023-01-16T05:05:35.071Z",
      "returnDate": "2023-01-17T05:05:35.071Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 19
    },
    {
      "bookTitle": "Art of Java Web Development: Struts, Tapestry, Commons, Velocity, JUnit, Axis, Cocoon, InternetBeans, WebWork",
      "bookId": 11,
      "rentDays": "1",
      "rentDate": "2023-01-16T05:05:36.787Z",
      "returnDate": "2023-01-17T05:05:36.787Z",
      "userId": "5",
      "rentExpired": false,
      "userName": "Arthi",
      "id": 20
    },
    {
      "bookTitle": "MODx Web Development",
      "bookId": 8,
      "rentDays": "1",
      "rentDate": "2023-01-16T09:34:00.786Z",
      "returnDate": "2023-01-17T09:34:00.786Z",
      "userId": "9",
      "rentExpired": false,
      "userName": "Hamza",
      "id": 21
    },
    {
      "bookTitle": "MODx Web Development",
      "bookId": 8,
      "rentDays": "1",
      "rentDate": "2023-01-16T09:34:17.814Z",
      "returnDate": "2023-01-17T09:34:17.814Z",
      "userId": "9",
      "rentExpired": false,
      "userName": "Hamza",
      "id": 23
    },
    {
      "bookTitle": "PHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax: A practical guide to combining the power, performance, scalability, ... time, and high performance of PHP",
      "bookId": 6,
      "rentDays": "10",
      "rentDate": "2023-01-18T07:14:43.731Z",
      "returnDate": "2023-01-28T07:14:43.731Z",
      "userId": "2",
      "rentExpired": false,
      "userName": "Dhanush",
      "borrowedQuantity": "5",
      "id": 29
    },
    {
      "bookTitle": "Beginning CSS Web Development: From Novice to Professional",
      "bookId": 13,
      "rentDays": "5",
      "rentDate": "2023-01-18T11:41:25.920Z",
      "returnDate": "2023-01-23T11:41:25.920Z",
      "userId": "3",
      "rentExpired": false,
      "userName": "TKR",
      "borrowedQuantity": "3",
      "id": 30
    }
  ]
}